OdIfcFile.getGeomExtents(OdGeExtents3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current geometrical extents of the model.
\param ext [out] A placeholder for the current geometry extents object to be returned to a calling subroutine.
\returns Returns eOk if the current extents were successfully returned; otherwise, the method returns an appropriate error code.
\remarks
The method returns the model extents only if the model was created by calling the setGeomResource() method.
The method accepts an instance of the OdGeExtents3d class, fills it with the data about the model's extents and
returns it to a calling subroutine.

OdIfcFile.getContextSelected(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if IfcGeometricRepresentationContext is selected to build geometry.
\param idCtx [in] Object ID of geometric context to test.

OdIfcFile.unresolveEntities
\details
Unresolve entities in the IFC model.
\returns Returns eOk if the unresolve was successfull; otherwise, the method returns an appropriate error code.

OdIfcFile.getProjectId
\details
Retrieves the IFC model's root entity.
\returns Returns the identifier of the root entity of the model.
\remarks
Each valid IFC file must have exactly one root entity.

OdIfcFile.writeFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Writes data from the file object to a physical file.
\param filename     [in] A string that contains the full path to the output file to write data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns Returns eOk if the data was successfully written; otherwise, the method returns an appropriate error.

OdIfcFile.readFile(OdSmartPtr&lt;OdStreamBuf&gt;)
\details
Reads data from a specified IFC file.
\param fileName [in] A string that contains the full path to the input file to read data from.
\returns Returns eOk if the data was successfully read; otherwise, the method returns an appropriate error.

OdIfcFile.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Reads data from a specified IFC file.
\param fileName [in] A string that contains the full path to the input file to read data from.
\returns Returns eOk if the data was successfully read; otherwise, the method returns an appropriate error.

OdIfcFile.detach
\details
Closes associated model and detaches an associated repository with model from an OdIfcFile. The work with repository and model
can be continued at low-level way.
\returns Returns a smart pointer to unattached Repository instance.

OdIfcFile.initialize(OdDAI.Repository*)
\details
Initializes OdIfcFile instance with repository if it contains appropriate information for IFC format
(single model of supported IFC schema), the model is become opened on read-only access by default and will keep this access
right on the time when its repository attached to OdIfcFile.
\param pRepo [in] Repository to attach to the OdIfcFile.
\returns Returns eOk if the Repository was successfully attached to the OdIfcFile.

OdIfcFile.initialize(InitialSchema)
\details
Initializes the IFC file object with a specified scheme.
\param modelScheme [in] A string that contains the scheme name.
\returns Returns eOk if the file was successfully initialized; otherwise, the method returns an appropriate error.

OdIfcFile.getFileName
Retrieves the current name (file name) of a physical file associated with the repository object.
\returns Returns a string that contains the file name.